Revit 2024 API
Application.ShortCurveTolerance Property
 The enforced minimum length for any curve created by Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double ShortCurveTolerance { get; }
Visual Basic
Public ReadOnly Property ShortCurveTolerance As Double
	Get
Visual C++
public:
property double ShortCurveTolerance {
	double get ();
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace